let heroesJSON = `[{
    "name": "Бетмен",
    "universe": "DC Comics",
    "alterego": "Брюс Уэйн",
    "occupation": "борец с преступностью, филантроп, миллиардер",
    "friends": "Робин, Бэтгерл",
    "superpowers": "интеллект, обширные познания, знания боевых искусств, ловкость",
    "url": "https://n1s1.hsmedia.ru/13/a5/b2/13a5b2373d5e23489d9a4949ada5b927/547x397_0xac120002_8752067681540468870.jpg",
    "info": "По популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности. Брюс знаменит, несмотря на пожилой возраст: первый выпуск с его участием вышел аж в 1939 году. С каждым годом популярность только крепнет. Большую роль в этом сыграли экранизации: «Темный рыцарь», сериал «Готэм» и несколько одноименных картин. Главная причина такой любви среди фанатов — мысль, что каждый может стать Бэтменом. Если подумать, это один из немногих героев, кто добился своего положения за счет ума и упорства, а не за счет мутаций."},
    {
        "name": "Супермен",
        "universe": "DC Comics",
        "alterego": "Кларк Кент",
        "occupation": "борец за справедливость",
        "friends": "собака Крипто",
        "superpowers": "непробиваемость, суперсила, полёт, самоисцеление, суперзрение и суперслух, классный костюм",
        "url" : "https://n1s1.hsmedia.ru/06/d3/73/06d37321618034ec5f2a65b09c8576e3/547x397_0xac120002_45567661540468871.jpg",
        "info": "Полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена. Супермен — некий хамелеон от мира комиксов. В своем первом выпуске в 1938 году он был просто человек-огромный мускул, который умел только разбивать стены и выбивать двери. Позднее к его умениям добавилась способность летать. Дальше у многочисленных воплощений Кларка, от подростка в «Тайнах Смоллвиля» до величественного «Человека из стали», разный уровень и количество суперспособностей. Неизменным остается его слабое место — уязвимость к Криптониту, радиоактивному веществу с родной планеты." 
    },{
        "name": "Железный человек",
        "universe": "Marvel Comics",
        "alterego": "Тони Старк",
        "occupation": "гений, миллиардер, плейбой, филантроп",
        "friends": "Мстители",
        "superpowers": "высокий уровень интеллекта, широкие познания науки и техники, связь со всемирной паутиной, бронекостюмы",
        "url" : "https://n1s1.hsmedia.ru/7b/56/08/7b5608ec3df83d872fa1162fb9e32f28/547x397_0xac120002_1773711401540468871.jpg",
        "info": "Пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже. Прототипом для героя послужили Илон Маск и изобретатель Говард Хьюз. Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
    },{
        "name": "Спайдер-мен/Человек-паук",
        "universe": "Marvel Comics",
        "alterego": "Питер Паркер",
        "occupation": "борец за справедливость, студент, фотограф",
        "friends": "Мстители, Фантастическая четверка, Люди Икс",
        "superpowers": "сверхчеловеческие рефлексы, «паучье чутьё», способность прилепляться к твердым поверхностям, производство паутины",
        "url" : "https://n1s1.hsmedia.ru/37/39/74/373974effcc7ccd093d849e8fa062091/547x397_0xac120002_9548247751540468871.jpg",
        "info": "Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка:) Питер не сразу использовал свои силы во благо людей: изначально он хотел делать на них деньги, участвуя в нелегальных боях без правил. Затем его любимый дядя Бен умер от рук грабителя, и подросток поклялся, что очистит свой родной Нью-Йорк ото зла. Однако спустя время подросток понял, что одной клятвы недостаточно и что «с великой силой приходит великая ответственность». Кстати, не все суперсилы у Питера появились за счет мутации: парень самостоятельно взломал технологию Тони Старка, после чего заслужил его признание. "
    },{
        "name": "Капитан Америка",
        "universe": "Marvel Comics",
        "alterego": "Стивен Роджерс",
        "occupation": "супер-солдат",
        "friends": "Мстители",
        "superpowers": "сила, выносливость, бессмертие, быстрая регенерация, мастерство скрытности и боя",
        "url" : "https://n1s1.hsmedia.ru/41/8f/05/418f050c767eeca8854b328914c7bccc/547x397_0xac120002_20106541761540468871.jpg",
        "info": "Капитан Америка — персонаж, целеноправленно созданный, чтобы воплощать идеалы патриотизма. Потому он был особенно популярный во время Второй мировой войны. В комиксах обращение «Капитан Америка» применяется к любому, кто выбран правительством США. Больше всего оно закрепилось именно за Стивом Роджерсом. Стив родился в 1917 году в семье ирландских эмигрантов Сары и Джозефа Роджерсов. В детстве он был очень слабым юношей и постоянно подвергался насмешкам со стороны других ребят. Ирландские корни давали о себе знать, потому парень от драки не лез. В начале Второй мировой войны Стивен стремился попасть на фронт. Естественно, из-за здоровья ему отказывали. По воле судьбы ему предложили принять участие в секретном оборонном проекте, целью которого было создание суперсолдат. Несмотря на сложности во время эксперимента, результат был успешным. Роджерс превратился из хилого юноши в настоящего Аполлона. Актер Крис Эванс с этой ролью вполне справился:)"
    },{
        "name": "Тор",
        "universe": "Marvel Comics",
        "alterego": "нет; полное имя — Тор Одинсон",
        "occupation": "борец за справедливость, скандинавский бог",
        "friends": "Мстители",
        "superpowers": "всё, что может бог, плюс молот Мьелнир",
        "url" : "https://n1s1.hsmedia.ru/52/a3/e1/52a3e14a0c8f02715b763e7a20fe1c00/547x397_0xac120002_19311926741540468872.jpg",
        "info": "Персонаж Тора основан на образе одноименного скандинавского бога. Тор во вселенной Marvel — родной сын Одина и древнейшей богини Геи. После рождения сына Один забрал его в Асгард, где растил вместе со своей женой, богиней Фригг. Последнюю Тор всегда считал своей настоящей матерью и лишь много позже узнал правду о своем рождении. Стоит сказать, что до нынешнего Тора в исполнении Криса Хемсворта у супергероя было несколько воплощений. В одном из них он погиб в схватке с мифическим змеем Мидгардом. Это привело к Рагнареку — некоему апокалипсису в скандинавской мифологии. "
    },{
        "name": "Халк",
        "universe": "Marvel Comics",
        "alterego": "Брюс Беннер",
        "occupation": "супергерой, борец за справедливость, ученый-биохимик",
        "friends": "Мстители",
        "superpowers": "сверхчеловеческая сила и скорость, выносливость, полёт",
        "url" : "https://n1s1.hsmedia.ru/9a/28/e7/9a28e7b059594fc10387669ae4bd2f22/547x397_0xac120002_20162335021540468872.jpg",
        "info": "Идею создания Халка как персонажа можно отнести к фантастической новелле «Странная история доктора Джекила и мистера Хайда», в которой ученый не может примириться со своим демоническим альтер эго. Прошлое у Халка — хуже некуда: отец Брюса страдал от алкоголизма и приступов ярости, а мать пыталась всеми силами уберечь сына от гнева своего мужа. Она погибла, защищая своего единственного ребенка от его побоев. Пронеся через все детство тяжелый психологический груз, Брюс вырос в чрезвычайно одаренного, но замкнутого юношу. Хотя Брюс не мог уважать отца, но пошел в науке по его стопам и выбрал ядерную физику. Во время эксперимента он ввел себе пробную сыворотку и подверг себя воздействию большого количества гамма-радиации. Беннер превратился в мускулистого неуправляемого гиганта, который крушил все вокруг и не понимал, что происходит. Так имя Халка стало нарицательным для людей, который не могут держать себя в руках."
    },{
        "name": "Чудо-женщина",
        "universe": "DC Comics",
        "alterego": "Диана Принс",
        "occupation": "супергероиня, секретарь-референт",
        "friends": "Лига Справедливости, Бэтмен, Супермен",
        "superpowers": "сверхчеловеческая сила искорость, выносливость, полёт",
        "url" : "https://n1s1.hsmedia.ru/87/ed/c5/87edc525d8813c7b2899e04a4e562fe9/547x397_0xac120002_6444132261540468872.jpg",
        "info": "Пора бы разбавить эту мужскую вечеринку по-настоящему крутой девчонкой :) Принцесса-амозонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Своё настоящее имя Диана она получила в честь древнегреческой богини охоты, а суперспособности от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма. У Дианы есть супер-снаряжение: лассо истины и тиара. Первое было сковано богом огня Гефестом, и оно никогда не промахивается. Человек, попавший в его петлю, неизбежно расскажет свои секреты, вспомнит забытое и даже подчинится приказам. Тиара же работает как метательное оружие, способное рассечь что угодно. Корона со звездой в центре символизирует патриотизм американской героини и служит стильным аксессуаром :)"
    },{
        "name": "Черная вдова",
        "universe": "Marvel Comics",
        "alterego": "Наташа Романофф",
        "occupation": "супергероиня, шпионка",
        "friends": "Мстители",
        "superpowers": "пик человеческого физического потенциала, замедленное старение, знание многих языков",
        "url" : "https://n1s1.hsmedia.ru/e0/2b/55/e02b55b147eeaff9b3fe6bdbb36ff9ea/547x397_0xac120002_744074131540468872.jpg",
        "info": "Супергероиня российского происхождения, родилась предположительно в 1928 году в Сталинграде. Во время Второй мировой войны она потеряла родителей и была спасена из горящего дома советским солдатом. Тот на некоторое время стал её опекуном. Повзрослев, Наташа попала в организацию «Красная Комната», где прошла многочисленные тренировки, а именно — была частью шпионской программы. Там же ей вживили сыворотку Суперсолдата, как у Капитана Америки, но в советском варианте. Благодаря ей, Наташа может использовать максимальные возможности своего организма: силу, гибкость, скорость, ловкость и т. д. Также сыворотка даёт эффект замедленного старения. По мнению фанатов, самое главное преимущество Чёрной Вдовы — то, что её сыграла красотка Скарлетт Йоханссон :) "
    },{
        "name": "Дэдпул",
        "universe": "Marvel Comics",
        "alterego": "Уэйд Уинстон Уилсон",
        "occupation": "антигерой, наёмник",
        "friends": "частично Мстители, Человек-паук, Росомаха",
        "superpowers": "высокий болевой порог, регенерация и бессмертие, сверхчеловеческая иммунная система",
        "url" : "https://n1s1.hsmedia.ru/34/93/39/3493392c94fc2ae0552ef9c7e87f2617/728x382_1_cc2a743fd686b7b2e256c062966bb465@1034x543_0xac120002_2692921231540468872.jpg",
        "info": "Как и Росомаха из Людей Икс, Дэдпул был подвергнут опытам по программе «Оружие Икс». Ученые попытались исцелить его рак, привив его клеткам способность к регенерации. Как и всегда в комиксах, что-то пошло не так, и Дэдпул остался изуродованным и психически нестабильным. Это единственный супергерой из списка, который однозначно не на стороне добра. Дэдпул наслаждается насилием. Первоначально появившись в основной Вселенной Marvel, он получил альтернативные варианты в других реальностях Мультивселенной. Что оставалось неизменным — его циничное, чёрное чувство юмора: за него Дэдпула прозвали «Болтливым наёмником»."
    }]`;
// помещаем информацию в json

const heroesList = document.querySelector(".main-container_list"); //находим разметку в DOM, куда нужно поместить список героев
const heroes = JSON.parse(heroesJSON); // преобразовываем JSON в массив

const createCard = (obj) => {
  // создаем функцию, которая создает разметку и помещает туда элементы из массива (список героев)
  const item = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе информацию о супергерое
  item.className = "list_item"; //добавляем класс к созданному выше div
  const name = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе имя супергероя
  name.className = "item_name"; //добавляем класс к созданному выше div
  name.textContent = obj.name; //добавляем текстовое содержимое для имени, вставляем объект из массива
  const universe = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе вселенную супергероя
  universe.className = "item_universe"; //добавляем класс к созданному выше div
  universe.textContent = `Вселенная:${obj.universe}`; //добавляем текстовое содержимое для вселенной, вставляем объект из массива
  const alterego = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе альтерэго супергероя
  alterego.className = "item_alterego"; //добавляем класс к созданному выше div
  alterego.textContent = `Альтер-эго:${obj.alterego}`; //добавляем текстовое содержимое для альтерэго, вставляем объект из массива
  const occupation = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе вид деятельности супергероя
  occupation.className = "item_occupation"; //добавляем класс к созданному выше div
  occupation.textContent = `Род деятельности:${obj.occupation}`; //добавляем текстовое содержимое для вида деятельности, вставляем объект из массива
  const friends = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе друзей супергероя
  friends.className = "item_friends"; //добавляем класс к созданному выше div
  friends.textContent = `Друзья:${obj.friends}`; //добавляем текстовое содержимое для друзей, вставляем объект из массива
  const superpowers = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе способности супергероя
  superpowers.className = "item_superpowers"; //добавляем класс к созданному выше div
  superpowers.textContent = `Суперсилы:${obj.superpowers}`; //добавляем текстовое содержимое для способностей, вставляем объект из массива
  const image = document.createElement("img"); // создаем переменную, которая создает img, который будет содержать в себе изображение супергероя
  image.className = "item_image"; //добавляем класс к созданному выше img
  image.alt = "imageHero"; // добавляем alt
  image.src = obj.url; // добавляем src для img, вставляем объект из массива
  const info = document.createElement("div"); // создаем переменную, которая создает div, который будет содержать в себе описание супергероя
  info.className = "item_info"; // добавляем класс к созданному выше div
  info.textContent = obj.info; //добавляем текстовое содержимое для описания, вставляем объект из массива

  let ratingForm = document.createElement("form"); // создаем по такому же принципу разметку для формы для рейтинга
  ratingForm.className = "rating"; // добавляем класс
  ratingForm.id = "form"; // добавляем id
  let label1 = document.createElement("label"); // создаем разметку для label
  let input1 = document.createElement("input"); // создаем разметку для input
  input1.type = "checkbox"; // добавляем к input тип - checkbox
  input1.className = "rating_input"; // добавляем к input класс
  input1.value = "1"; // добавляем к input value
  input1.name = "rating"; // добавляем к input имя
  let span1 = document.createElement("span"); // создаем разметку для span, который будет содержать в себе звезду
  span1.className = "input-star"; // добавляем к span класс
  span1.id = "1"; // добавляем к span id
  span1.textContent = "★"; // добавляем к span текстовое содержимое, в нашем случае - звезду
  let label2 = document.createElement("label"); // далее по такому же принципу создаем label, input и span для оставшихся 4 звезд
  let input2 = document.createElement("input");
  input2.type = "checkbox";
  input2.className = "rating_input";
  input2.value = "2";
  input2.name = "rating";
  let span2 = document.createElement("span");
  span2.className = "input-star";
  span2.id = "2";
  span2.textContent = "★";
  let label3 = document.createElement("label");
  let input3 = document.createElement("input");
  input3.type = "checkbox";
  input3.className = "rating_input";
  input3.value = "3";
  input3.name = "rating";
  let span3 = document.createElement("span");
  span3.className = "input-star";
  span3.id = "3";
  span3.textContent = "★";
  let label4 = document.createElement("label");
  let input4 = document.createElement("input");
  input4.type = "checkbox";
  input4.className = "rating_input";
  input4.value = "4";
  input4.name = "rating";
  let span4 = document.createElement("span");
  span4.className = "input-star";
  span4.id = "4";
  span4.textContent = "★";
  let label5 = document.createElement("label");
  let input5 = document.createElement("input");
  input5.type = "checkbox";
  input5.className = "rating_input";
  input5.value = "5";
  input5.name = "rating";
  let span5 = document.createElement("span");
  span5.className = "input-star";
  span5.id = "5";
  span5.textContent = "★";

  ratingForm.append(label1); // вставляем label-ы в ранее созданную форму
  ratingForm.append(label2);
  ratingForm.append(label3);
  ratingForm.append(label4);
  ratingForm.append(label5);
  label1.append(input1); // вставляем input-ы в ранее созданную форму
  label1.append(span1); // вставляем span-ы в ранее созданную форму
  label2.append(input2);
  label2.append(span2);
  label3.append(input3);
  label3.append(span3);
  label4.append(input4);
  label4.append(span4);
  label5.append(input5);
  label5.append(span5);

  item.append(name); // вставляем имя супергероя в карточку
  item.append(universe); // вставляем вселенную супергероя в карточку
  item.append(alterego); // вставляем альтерэго супергероя в карточку
  item.append(occupation); // вставляем вид деятельности супергероя в карточку
  item.append(friends); // вставляем друзей супергероя в карточку
  item.append(superpowers); // вставляем суперсилы супергероя в карточку
  item.append(image); // вставляем изображение супергероя в карточку
  item.append(info); // вставляем описание супергероя в карточку
  item.append(ratingForm); // вставляем рейтинг со звездами в карточку

  return item; // возвращаем карточку со всей заполненной информацией
};

const addCard = (objItem, container) => {
  // создаем функцию, которая будет добавлять новые блоки к уже созданным
  const item = createCard(objItem);
  container.append(item);
};

document.addEventListener("DOMContentLoaded", () => {
  // создаем функцию, которая будет перебирать объекты массива по очереди и добавлять их в разметку Html
  heroes.forEach((element) => {
    addCard(element, heroesList);
  });
});

heroesList.addEventListener("click", (event) => {
  // создаем функцию, которая будет срабатывать при клике на звезды
  if (event.target.classList.contains("rating_input")) {
    // создаем условие, которое определяет, сколько звезд нужно закрасить
    const form = event.target.parentNode.parentNode; // создаем переменную и находим форму (дочерний элемент дочернего от родителя)
    const inputs = form.querySelectorAll(".rating_input"); // создаем переменную и находим инпуты
    const icons = form.querySelectorAll(".input-star"); // создаем переменную и находим спаны со звездами
    const listItem = form.parentNode; // создаем переменную и находим элементы, содержащие информацию о герое (дочерний элемент от родителя, от формы)
    const key = listItem.querySelector(".item_name").textContent; // создаем переменную и находим имя героя
    const value = Number(event.target.value); // создаем переменную и преобразовываем в число value от инпута

    icons.forEach((elem, i) => {
      //функция, которая изначально закрашивает все звезды в серый цвет
      elem.style = "color: grey;";
    });

    for (let i = 0; i < value; i++) {
      //условие, которое перебирает звезды, и если их id < value выбранного инпута, то закрашивает в золотой цвет и прекращает цикл
      icons[i].style = "color: gold"; // попадаем в цикл, звезда 1 - закрашиваем, потом смотрим, следующий инпут кликнут или нет >
      if (inputs[i].checked) {
        inputs[i].checked = false; // если кликнут, то цикл завершается и дальше не идет окрашивание
        break;
      }
    }
    localStorage.setItem(key, value); // выводим имя героя и значение рейтинга в localstorage
  }
});
